zk874009306/KernelDriver/project/board/pin_mux.c
  IOCON_PinMuxSet(IOCON, PORT0_IDX, PIN29_IDX, port0_pin29_config); /* PORT0 PIN29 (coords: B13) is configured as FC0_RXD_SDA_MOSI */
  const uint32_t port0_pin30_config = (
    IOCON_PIO_FUNC1 |                                        /* Pin is configured as FC0_TXD_SCL_MISO */
    IOCON_PIO_MODE_INACT |                                   /* No addition pin function */
    IOCON_PIO_INV_DI |                                       /* Input function is not inverted */
    IOCON_PIO_DIGITAL_EN |                                   /* Enables digital function */
    IOCON_PIO_INPFILT_OFF |                                  /* Input filter disabled */
    IOCON_PIO_SLEW_STANDARD |                                /* Standard mode, output slew rate control is enabled */
    IOCON_PIO_OPENDRAIN_DI                                   /* Open drain is disabled */
  );

  IOCON_PinMuxSet(IOCON, PORT0_IDX, PIN30_IDX, port0_pin30_config); /* PORT0 PIN30 (coords: A2) is configured as FC0_TXD_SCL_MISO */
  const uint32_t port1_pin2_config = (
    IOCON_PIO_FUNC5 |                                        /* Pin is configured as PDM1_CLK */
    IOCON_PIO_MODE_PULLUP |                                  /* Selects pull-up function */
    IOCON_PIO_INV_DI |                                       /* Input function is not inverted */
    IOCON_PIO_DIGITAL_EN |                                   /* Enables digital function */
    IOCON_PIO_INPFILT_OFF |                                  /* Input filter disabled */
    IOCON_PIO_SLEW_STANDARD |                                /* Standard mode, output slew rate control is enabled */
    IOCON_PIO_OPENDRAIN_DI                                   /* Open drain is disabled */
  );
  IOCON_PinMuxSet(IOCON, PORT1_IDX, PIN2_IDX, port1_pin2_config); /* PORT1 PIN2 (coords: L14) is configured as PDM1_CLK */
  const uint32_t port1_pin3_config = (
    IOCON_PIO_FUNC5 |                                        /* Pin is configured as PDM1_DATA */
    IOCON_PIO_MODE_PULLUP |                                  /* Selects pull-up function */
    IOCON_PIO_INV_DI |                                       /* Input function is not inverted */
    IOCON_PIO_DIGITAL_EN |                                   /* Enables digital function */
    IOCON_PIO_INPFILT_OFF |                                  /* Input filter disabled */
    IOCON_PIO_SLEW_STANDARD |                                /* Standard mode, output slew rate control is enabled */
    IOCON_PIO_OPENDRAIN_DI                                   /* Open drain is disabled */
  );
  IOCON_PinMuxSet(IOCON, PORT1_IDX, PIN3_IDX, port1_pin3_config); /* PORT1 PIN3 (coords: J13) is configured as PDM1_DATA */


 const uint32_t port2_pin18_config = (
	IOCON_PIO_FUNC3 |                                        /* Pin is configured as FC7_SCK */
	IOCON_PIO_MODE_PULLUP |                                  /* Selects pull-up function */
	IOCON_PIO_INV_DI |                                       /* Input function is not inverted */
	IOCON_PIO_DIGITAL_EN |                                   /* Enables digital function */
	IOCON_PIO_INPFILT_OFF |                                  /* Input filter disabled */
	IOCON_PIO_SLEW_FAST |                                    /* Fast mode, slew rate control is disabled */
	IOCON_PIO_OPENDRAIN_DI                                   /* Open drain is disabled */
  );
 /* PORT2 PIN18 (coords: N10) is configured as FC7_SCK */
 IOCON_PinMuxSet(IOCON, PORT2_IDX, PIN18_IDX, port2_pin18_config);

 const uint32_t port2_pin19_config = (
	IOCON_PIO_FUNC3 |                                       /* Pin is configured as FC7_RXD_SDA_MOSI_DATA */
	IOCON_PIO_MODE_PULLUP |                                 /* Selects pull-up function */
	IOCON_PIO_INV_DI  |                                     /* Input function is not inverted */
	IOCON_PIO_DIGITAL_EN |                                  /* Enables digital function */
	IOCON_PIO_INPFILT_OFF |                                 /* Input filter disabled */
	IOCON_PIO_SLEW_FAST |                                   /* Fast mode, slew rate control is disabled */
	IOCON_PIO_OPENDRAIN_DI                                  /* Open drain is disabled */
 );
 /* PORT2 PIN19 (coords: P12) is configured as FC7_RXD_SDA_MOSI_DATA */
 IOCON_PinMuxSet(IOCON, PORT2_IDX, PIN19_IDX, port2_pin19_config);

 const uint32_t port2_pin20_config = (
	IOCON_PIO_FUNC3 |                                       /* Pin is configured as FC7_TXD_SCL_MISO_WS */
	IOCON_PIO_MODE_PULLUP |                                 /* Selects pull-up function */
	IOCON_PIO_INV_DI |                                      /* Input function is not inverted */
	IOCON_PIO_DIGITAL_EN |                                  /* Enables digital function */
	IOCON_PIO_INPFILT_OFF |                                 /* Input filter disabled */
	IOCON_PIO_SLEW_FAST |                                   /* Fast mode, slew rate control is disabled */
	IOCON_PIO_OPENDRAIN_DI                                  /* Open drain is disabled */
 );
 /* PORT2 PIN20 (coords: P13) is configured as FC7_TXD_SCL_MISO_WS */
 IOCON_PinMuxSet(IOCON, PORT2_IDX, PIN20_IDX, port2_pin20_config);

 const uint32_t port3_pin11_config = (
	IOCON_PIO_FUNC1 |                                       /* Pin is configured as MCLK */
	IOCON_PIO_MODE_INACT |                                  /* No addition pin function */
	IOCON_PIO_INV_DI |                                      /* Input function is not inverted */
	IOCON_PIO_DIGITAL_EN |                                  /* Enables digital function */
	IOCON_PIO_INPFILT_OFF |                                 /* Input filter disabled */
	IOCON_PIO_SLEW_STANDARD |                               /* Standard mode, output slew rate control is enabled */
	IOCON_PIO_OPENDRAIN_DI                                  /* Open drain is disabled */
 );
 /* PORT3 PIN11 (coords: B2) is configured as MCLK */
 IOCON_PinMuxSet(IOCON, PORT3_IDX, PIN11_IDX, port3_pin11_config);

#if 0
/* const uint32_t port3_pin23_config = (
	IOCON_PIO_FUNC1 |                                       /* Pin is configured as FC2_CTS_SDA_SSEL0 */
	IOCON_PIO_I2CSLEW_I2C |                                 /* I2C mode */
	IOCON_PIO_INV_DI |                                      /* Input function is not inverted */
	IOCON_PIO_DIGITAL_EN |                                  /* Enables digital function */
	IOCON_PIO_INPFILT_OFF |                                 /* Input filter disabled */
	IOCON_PIO_I2CDRIVE_HIGH |                               /* High drive: 20 mA */
	IOCON_PIO_I2CFILTER_DI                                  /* I2C 50 ns glitch filter disabled */
 );
 /* PORT3 PIN23 (coords: C2) is configured as FC2_CTS_SDA_SSEL0 */
 IOCON_PinMuxSet(IOCON, PORT3_IDX, PIN23_IDX, port3_pin23_config);

 const uint32_t port3_pin24_config = (
	IOCON_PIO_FUNC1 |                                       /* Pin is configured as FC2_RTS_SCL_SSEL1 */
	IOCON_PIO_I2CSLEW_I2C |                                 /* I2C mode */
	IOCON_PIO_INV_DI |                                      /* Input function is not inverted */
	IOCON_PIO_DIGITAL_EN |                                  /* Enables digital function */
	IOCON_PIO_INPFILT_OFF |                                 /* Input filter disabled */
	IOCON_PIO_I2CDRIVE_HIGH |                               /* High drive: 20 mA */
	IOCON_PIO_I2CFILTER_DI                                  /* I2C 50 ns glitch filter disabled */
 );

 /* PORT3 PIN24 (coords: E2) is configured as FC2_RTS_SCL_SSEL1 */
 IOCON_PinMuxSet(IOCON, PORT3_IDX, PIN24_IDX, port3_pin24_config);

#endif

 const uint32_t port4_pin1_config = (
	IOCON_PIO_FUNC2 |                                        /* Pin is configured as FC6_SCK */
	IOCON_PIO_MODE_PULLUP |                                  /* Selects pull-up function */
	IOCON_PIO_INV_DI |                                       /* Input function is not inverted */
	IOCON_PIO_DIGITAL_EN |                                   /* Enables digital function */
	IOCON_PIO_INPFILT_OFF |                                  /* Input filter disabled */
	IOCON_PIO_SLEW_FAST |                                    /* Fast mode, slew rate control is disabled */
	IOCON_PIO_OPENDRAIN_DI                                   /* Open drain is disabled */
 );
 /* PORT4 PIN1 (coords: G14) is configured as FC6_SCK */
 IOCON_PinMuxSet(IOCON, PORT4_IDX, PIN01_IDX, port4_pin1_config);

 const uint32_t port4_pin2_config = (
	 IOCON_PIO_FUNC2 |                                       /* Pin is configured as FC6_RXD_SDA_MOSI_DATA */
	 IOCON_PIO_MODE_PULLUP |                                 /* Selects pull-up function */
	 IOCON_PIO_INV_DI |                                      /* Input function is not inverted */
	 IOCON_PIO_DIGITAL_EN |                                  /* Enables digital function */
	 IOCON_PIO_INPFILT_OFF |                                 /* Input filter disabled */
	 IOCON_PIO_SLEW_FAST |                                   /* Fast mode, slew rate control is disabled */
	 IOCON_PIO_OPENDRAIN_DI                                  /* Open drain is disabled */
 );
 /* PORT4 PIN2 (coords: F14) is configured as FC6_RXD_SDA_MOSI_DATA */
 IOCON_PinMuxSet(IOCON, PORT4_IDX, PIN02_IDX, port4_pin2_config);

