zk874009306/KernelDriver/project/board/pin_mux.c
 const uint32_t port4_pin3_config = (
	IOCON_PIO_FUNC2 |                                        /* Pin is configured as FC6_TXD_SCL_MISO_WS */
	IOCON_PIO_MODE_PULLUP |                                  /* Selects pull-up function */
	IOCON_PIO_INV_DI |                                       /* Input function is not inverted */
	IOCON_PIO_DIGITAL_EN |                                   /* Enables digital function */
	IOCON_PIO_INPFILT_OFF |                                  /* Input filter disabled */
	IOCON_PIO_SLEW_FAST |                                    /* Fast mode, slew rate control is disabled */
	IOCON_PIO_OPENDRAIN_DI                                   /* Open drain is disabled */
 );
 /* PORT4 PIN3 (coords: F13) is configured as FC6_TXD_SCL_MISO_WS */
 IOCON_PinMuxSet(IOCON, PORT4_IDX, PIN03_IDX, port4_pin3_config);

    const uint32_t port1_pin17_config = (
		IOCON_PIO_FUNC0 |                                        /* Pin is configured as SX1278 RESET */
		IOCON_PIO_MODE_PULLUP |                                  /* Selects pull-up function */
		IOCON_PIO_INV_DI |                                       /* Input function is not inverted */
		IOCON_PIO_DIGITAL_EN |                                   /* Enables digital function */
		IOCON_PIO_INPFILT_OFF |                                  /* Input filter disabled */
		IOCON_PIO_SLEW_STANDARD |                                    /* Fast mode, slew rate control is disabled */
		IOCON_PIO_OPENDRAIN_DI                                   /* Open drain is disabled */
		);
		IOCON_PinMuxSet(IOCON, PORT1_IDX, PIN17_IDX, port1_pin17_config);

	const uint32_t port0_pin05_config = (
		IOCON_PIO_FUNC0 |                                        /* Pin is configured as SX1278 TXEN */
		IOCON_PIO_MODE_PULLUP |                                  /* Selects pull-up function */
		IOCON_PIO_INV_DI |                                       /* Input function is not inverted */
		IOCON_PIO_DIGITAL_EN |                                   /* Enables digital function */
		IOCON_PIO_INPFILT_OFF |                                  /* Input filter disabled */
		IOCON_PIO_SLEW_STANDARD |                                    /* Fast mode, slew rate control is disabled */
		IOCON_PIO_OPENDRAIN_DI                                   /* Open drain is disabled */
		);
		IOCON_PinMuxSet(IOCON, PORT0_IDX, PIN05_IDX, port0_pin05_config);

	const uint32_t port3_pin13_config = (
		IOCON_PIO_FUNC0 |                                        /* Pin is configured as SX1278 RXEN */
		IOCON_PIO_MODE_PULLUP |                                  /* Selects pull-up function */
		IOCON_PIO_INV_DI |                                       /* Input function is not inverted */
		IOCON_PIO_DIGITAL_EN |                                   /* Enables digital function */
		IOCON_PIO_INPFILT_OFF |                                  /* Input filter disabled */
		IOCON_PIO_SLEW_STANDARD |                                    /* Fast mode, slew rate control is disabled */
		IOCON_PIO_OPENDRAIN_DI                                   /* Open drain is disabled */
	     );
	IOCON_PinMuxSet(IOCON, PORT3_IDX, PIN13_IDX, port3_pin13_config);

	const uint32_t port1_pin18_config = (
		IOCON_PIO_FUNC0 |                                        /* Pin is configured as SX1278 DIO0 */
		IOCON_PIO_MODE_PULLUP |                                  /* Selects pull-up function */
		IOCON_PIO_INV_DI |                                       /* Input function is not inverted */
		IOCON_PIO_DIGITAL_EN |                                   /* Enables digital function */
		IOCON_PIO_INPFILT_OFF |                                  /* Input filter disabled */
		IOCON_PIO_SLEW_STANDARD |                                    /* Fast mode, slew rate control is disabled */
		IOCON_PIO_OPENDRAIN_DI                                   /* Open drain is disabled */
	     );
	IOCON_PinMuxSet(IOCON, PORT1_IDX, PIN18_IDX, port1_pin18_config);

	const uint32_t port2_pin0_config = (
		IOCON_PIO_FUNC0 |                                        /* Pin is configured as SX1278 DIO2 */
		IOCON_PIO_MODE_PULLUP |                                  /* Selects pull-up function */
		IOCON_PIO_INV_DI |                                       /* Input function is not inverted */
		IOCON_PIO_DIGITAL_EN |                                   /* Enables digital function */
		IOCON_PIO_INPFILT_OFF |                                  /* Input filter disabled */
		IOCON_PIO_SLEW_STANDARD |                                    /* Fast mode, slew rate control is disabled */
		IOCON_PIO_OPENDRAIN_DI                                   /* Open drain is disabled */
		 );
    IOCON_PinMuxSet(IOCON, PORT2_IDX, PIN0_IDX, port2_pin0_config);

	const uint32_t port4_pin06_config = (
		IOCON_PIO_FUNC0 |                                        /* Pin is configured as FC9_CTS_SDA_SSEL0 */
		IOCON_PIO_MODE_PULLUP |                                  /* Selects pull-up function */
		IOCON_PIO_INV_DI |                                       /* Input function is not inverted */
		IOCON_PIO_DIGITAL_EN |                                   /* Enables digital function */
		IOCON_PIO_INPFILT_OFF |                                  /* Input filter disabled */
		IOCON_PIO_SLEW_STANDARD |                                /* Standard mode, output slew rate control is enabled */
		IOCON_PIO_OPENDRAIN_DI                                   /* Open drain is disabled */
		);
	IOCON_PinMuxSet(IOCON, PORT4_IDX, PIN06_IDX, port4_pin06_config); /* PORT3 PIN30 (coords: K13) is configured as FC9_CTS_SDA_SSEL0 */

#if 0
	const uint32_t port0_pin02_config = (
	    IOCON_PIO_FUNC1 |                                        /* Pin is configured as FC3_MISO*/
	    IOCON_PIO_MODE_PULLUP |                                  /* Selects pull-up function */
	    IOCON_PIO_INV_DI |                                       /* Input function is not inverted */
	    IOCON_PIO_DIGITAL_EN |                                   /* Enables digital function */
	    IOCON_PIO_INPFILT_OFF |                                  /* Input filter disabled */
	    IOCON_PIO_SLEW_STANDARD |                                /* Standard mode, output slew rate control is enabled */
	    IOCON_PIO_OPENDRAIN_DI                                   /* Open drain is disabled */
	  );
	  IOCON_PinMuxSet(IOCON, PORT0_IDX, PIN02_IDX, port0_pin02_config); /* PORT0 PIN02 (coords: N2) is configured as FC3_MISO */
	  const uint32_t port0_pin03_config = (
	    IOCON_PIO_FUNC1 |                                        /* Pin is configured as FC3_MOSI */
	    IOCON_PIO_MODE_PULLUP |                                  /* Selects pull-up function */
	    IOCON_PIO_INV_DI |                                       /* Input function is not inverted */
	    IOCON_PIO_DIGITAL_EN |                                   /* Enables digital function */
	    IOCON_PIO_INPFILT_OFF |                                  /* Input filter disabled */
	    IOCON_PIO_OPENDRAIN_DI                                   /* Open drain is disabled */
	  );
	  IOCON_PinMuxSet(IOCON, PORT0_IDX, PIN03_IDX, port0_pin03_config); /* PORT0 PIN03 (coords: P5) is configured as FC3_MOSI */
	  const uint32_t port0_pin0_config = (
	    IOCON_PIO_FUNC2 |                                        /* Pin is configured as FC3_CLK */
	    IOCON_PIO_MODE_PULLUP |                                  /* Selects pull-up function */
	    IOCON_PIO_INV_DI |                                       /* Input function is not inverted */
	    IOCON_PIO_DIGITAL_EN |                                   /* Enables digital function */
	    IOCON_PIO_INPFILT_OFF |                                  /* Input filter disabled */
	    IOCON_PIO_OPENDRAIN_DI                                   /* Open drain is disabled */
	  );
	  IOCON_PinMuxSet(IOCON, PORT0_IDX, PIN0_IDX, port0_pin0_config); /* PORT0 PIN0 (coords: N5) is configured as FC3_CLK */

	  const uint32_t port0_pin01_config = (
	  		IOCON_PIO_FUNC0 |                                        /* Pin is configured as FC9_CTS_SDA_SSEL0 */
	  		IOCON_PIO_MODE_PULLUP |                                  /* Selects pull-up function */
	  		IOCON_PIO_INV_DI |                                       /* Input function is not inverted */
	  		IOCON_PIO_DIGITAL_EN |                                   /* Enables digital function */
	  		IOCON_PIO_INPFILT_OFF |                                  /* Input filter disabled */
	  		IOCON_PIO_SLEW_STANDARD |                                /* Standard mode, output slew rate control is enabled */
	  		IOCON_PIO_OPENDRAIN_DI                                   /* Open drain is disabled */
	  		);
	  	IOCON_PinMuxSet(IOCON, PORT0_IDX, PIN01_IDX, port0_pin01_config); /* PORT0 PIN01 (coords: K13) is configured as FC9_CTS_SDA_SSEL0 */
#endif

	    const uint32_t port0_pin26_config = (
	      IOCON_PIO_FUNC1 |                                        /* Pin is configured as FC2_RXD_SDA_MOSI */
	      IOCON_PIO_MODE_PULLUP |                                  /* Selects pull-up function */
	      IOCON_PIO_INV_DI |                                       /* Input function is not inverted */
	      IOCON_PIO_DIGITAL_EN |                                   /* Enables digital function */
	      IOCON_PIO_INPFILT_OFF |                                  /* Input filter disabled */
	      IOCON_PIO_SLEW_STANDARD |                                /* Standard mode, output slew rate control is enabled */
	      IOCON_PIO_OPENDRAIN_DI                                   /* Open drain is disabled */
	    );
	    IOCON_PinMuxSet(IOCON, PORT0_IDX, PIN26_IDX, port0_pin26_config); /* PORT0 PIN26 (coords: M13) is configured as FC2_RXD_SDA_MOSI */
	    const uint32_t port0_pin27_config = (
	      IOCON_PIO_FUNC1 |                                        /* Pin is configured as FC2_TXD_SCL_MISO */
	      IOCON_PIO_MODE_PULLUP |                                  /* Selects pull-up function */
	      IOCON_PIO_INV_DI |                                       /* Input function is not inverted */
	      IOCON_PIO_DIGITAL_EN |                                   /* Enables digital function */
	      IOCON_PIO_INPFILT_OFF |                                  /* Input filter disabled */
	      IOCON_PIO_SLEW_STANDARD |                                /* Standard mode, output slew rate control is enabled */
	      IOCON_PIO_OPENDRAIN_DI                                   /* Open drain is disabled */
	    );
	    IOCON_PinMuxSet(IOCON, PORT0_IDX, PIN27_IDX, port0_pin27_config); /* PORT0 PIN27 (coords: L9) is configured as FC2_TXD_SCL_MISO */
	    const uint32_t port3_pin23_config = (
	      IOCON_PIO_FUNC0 |                                        /* Pin is configured as FC2_CTS_SDA_SSEL0 */
	      IOCON_PIO_I2CSLEW_GPIO |                                 /* GPIO mode */
	      IOCON_PIO_INV_DI |                                       /* Input function is not inverted */
	      IOCON_PIO_DIGITAL_EN |                                   /* Enables digital function */
	      IOCON_PIO_INPFILT_OFF |                                  /* Input filter disabled */
	      IOCON_PIO_I2CDRIVE_LOW |                                 /* Low drive: 4 mA */
	      IOCON_PIO_I2CFILTER_DI                                   /* I2C 50 ns glitch filter disabled */
	    );
	    IOCON_PinMuxSet(IOCON, PORT3_IDX, PIN23_IDX, port3_pin23_config); /* PORT3 PIN23 (coords: C2) is configured as FC2_CTS_SDA_SSEL0 */
	    const uint32_t port4_pin8_config = (
	        IOCON_PIO_FUNC2 |                                        /* Pin is configured as FC2_SCK */
	        IOCON_PIO_MODE_PULLUP |                                  /* Selects pull-up function */
	        IOCON_PIO_INV_DI |                                       /* Input function is not inverted */
	        IOCON_PIO_DIGITAL_EN |                                   /* Enables digital function */
	        IOCON_PIO_INPFILT_OFF |                                  /* Input filter disabled */
	        IOCON_PIO_SLEW_STANDARD |                                /* Standard mode, output slew rate control is enabled */
	        IOCON_PIO_OPENDRAIN_DI                                   /* Open drain is disabled */
	      );
	      IOCON_PinMuxSet(IOCON, PORT4_IDX, PIN8_IDX, port4_pin8_config); /* PORT4 PIN8 (coords: B14) is configured as FC2_SCK */
}
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
SPI9_InitPins:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: N2, peripheral: FLEXCOMM9, signal: SCK, pin_signal: PIO3_20/FC9_SCK/SD_CARD_INT_N/CLKOUT/SCT0_OUT7}
  - {pin_num: P5, peripheral: FLEXCOMM9, signal: RXD_SDA_MOSI, pin_signal: PIO3_21/FC9_RXD_SDA_MOSI/SD_BACKEND_PWR/CTIMER4_MAT3/UTICK_CAP2/ADC0_9}
  - {pin_num: N5, peripheral: FLEXCOMM9, signal: TXD_SCL_MISO, pin_signal: PIO3_22/FC9_TXD_SCL_MISO/ADC0_10}
  - {pin_num: K13, peripheral: FLEXCOMM9, signal: CTS_SDA_SSEL0, pin_signal: PIO3_30/FC9_CTS_SDA_SSEL0/SCT0_OUT4/FC4_SSEL2/EMC_A(19)}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

